# St7SetSRABaseCaseTable

Sets the table associated with the specified Spectral Response analysis Base Excitation case.

long St7SetSRABaseCaseTable(long uID, long SRACase, long TableID)
Input Parameters
uID
Strand7 model file ID.
SRACase
Spectral Response base excitation case number.
TableID
Table ID number, or 0 for none.